## Terraform Plan 📋

<details>
<summary>Show Plan</summary>

```terraform
module.eks_cluster.module.eks.time_sleep.this[0] (deposed object ce4ca221): Refreshing state... [id=2025-11-08T19:11:25Z]
module.eks_cluster.module.eks.time_sleep.this[0] (deposed object 570032f6): Refreshing state... [id=2025-11-07T08:54:48Z]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.networking.data.aws_region.current: Reading...
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks_cluster.aws_iam_role.node_group: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ml-platform-dev/cluster]
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.networking.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a4dc7d098adfbaac]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.security.data.aws_caller_identity.current: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks_cluster.module.eks.aws_iam_role.this[0]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002]
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.security.data.aws_caller_identity.current: Read complete after 0s [id=984479408136]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-19207049638]
module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ml-platform-dev-cluster-20251107084424449600000002/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0]: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy: Refreshing state... [id=ml-platform-dev-ng-20251107084424450100000003/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.networking.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07156dd2ffd088d28]
module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0a4dc7d098adfbaac]
module.networking.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0d866c579bcb164ab]
module.eks_cluster.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-016773c24bd3bf902]
module.networking.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-088eac3503dc04458]
module.networking.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-089b84d402fd388ff]
module.networking.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08b61f39bef93fc7e]
module.networking.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0a93e8a950f7a4da7]
module.eks_cluster.module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0c682263702172459]
module.networking.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-025d673457b5cda11]
module.networking.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ba7c571e56283a11]
module.networking.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08b58f4d0ea68a212]
module.networking.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-019888ac1266a9e2d]
module.networking.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-07c0937b82ee3c74b]
module.networking.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0777287f10d337b72]
module.networking.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-02ee2f23a18fd504b]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.networking.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0919ac91c04d36285]
module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=3192673856]
module.networking.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0287d3612a07f2dca]
module.networking.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-081b5fd511def0b45]
module.networking.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-033c35324f0e9b6a6]
module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1473448459]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-2508715334]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-2671322916]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"]: Refreshing state... [id=sgrule-2188597329]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"]: Refreshing state... [id=sgrule-3919059473]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"]: Refreshing state... [id=sgrule-163667322]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"]: Refreshing state... [id=sgrule-2094632133]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"]: Refreshing state... [id=sgrule-697459832]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-957005484]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-936369637]
module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-4086082020]
module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"]: Refreshing state... [id=sgrule-1992579817]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-829212976]
module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-60718187]
module.networking.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0fadda213452e1345]
module.networking.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0dc95eaf98c143917]
module.networking.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02b59a723cf493fc4]
module.networking.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0777287f10d337b721080289494]
module.networking.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-047d20ebe51cf2a7f]
module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251107084424449300000001/arn:aws:iam::984479408136:policy/vpc-flow-log-to-cloudwatch-2025110708443931220000000a]
module.eks_cluster.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ml-platform-dev]
module.networking.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0efeb8a0dd25e3324]
module.networking.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ba7c571e56283a111080289494]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-03fe93ef6eef8e1a7]
module.networking.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-03f67a529b2c9325e]
module.networking.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-05e020fdf66f24142]
module.networking.aws_vpc_endpoint.autoscaling: Refreshing state... [id=vpce-08e247010f1e4d889]
module.networking.aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-0dc3571bfbaee6d36]
module.networking.aws_vpc_endpoint.sts: Refreshing state... [id=vpce-08ac543a4b200fd42]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0eb7c9b6c2dd6ece8,Environment]
module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0eb7c9b6c2dd6ece8,Cluster]
module.eks_cluster.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-11-09T01:07:58Z]
module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1444722670864172653]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0]: Refreshing state... [id=lt-08fdb290be690713d]
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0]: Reading...
module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0]: Read complete after 0s [id=1795085966]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0]: Refreshing state... [id=ml-platform-dev:ml-platform-dev-ng-20251109010759293200000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_cluster.aws_iam_role.ebs_csi_driver[0] will be created
  + resource "aws_iam_role" "ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ml-platform-dev-ebs-csi-"
      + path                  = "/"
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-ebs-csi-driver"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-ebs-csi-driver"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.ebs_csi_driver[0] will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = (known after apply)
    }

  # module.networking.aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                         = "vpce-03fe93ef6eef8e1a7"
      ~ policy                     = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "*" -> [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      ~ Principal = "*" -> {
                          + AWS = "*"
                        }
                      ~ Resource  = "*" -> [
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringNotLike = {
                              + "s3:arn" = [
                                  + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                                  + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                                ]
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                    },
                ]
              ~ Version   = "2008-10-17" -> "2012-10-17"
            }
        )
        tags                       = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-vpc-s3-endpoint"
        }
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7"
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "ml-platform-dev"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "ml-platform-dev"
        name                          = "ml-platform-dev"
        tags                          = {
            "Cluster"               = "ml-platform-dev"
            "Environment"           = "dev"
            "terraform-aws-modules" = "eks"
        }
        # (14 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ]
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7"
        tags            = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-eks-irsa"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks_cluster.module.eks.time_sleep.this[0] (deposed object 570032f6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "time_sleep" "this" {
      - create_duration = "30s" -> null
      - id              = "2025-11-07T08:54:48Z" -> null
      - triggers        = {
          - "certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJTWVSQjBrcnFmbVF3RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRFeE1EY3dPRFExTWpoYUZ3MHpOVEV4TURVd09EVXdNamhhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUM3N0pOWFcrRXZKelBIUGVxRW5DQnRTbzZEU1RVUkNKTFl3dTU3VlRNbHFEeGlTZzA0aHEzellieHQKTlZOcHlIUms1RmI1Tlp0SkdXV2dnVW1tVWxyR0lVbEZmZEY1MkY5VE9RekthbUU0ZGZEZUZHdWVUUkd4eGx0TgpueTF5TmRpSHBRNlZwV29mV3BpRzFRc0JOQm1qMGdlTHZ2bi9VcUVma3Bla0pCZUxoeXdpYVNnemU2eXRrMk5KCkFpamluclM4TVBraU0zYmgvd0FCa3l4ODBpMXVEdkNveTNXNTZmU0pocFBqdUthbWsweWI3V1gwSkREL3hHdnQKeFM2UENFclNrNzVZV0dJUFhVOW9IYWZZZzB5TkRydjRlL3JOaDVNd3FjaTFYUFJieExVTjlYM1pGelVINThhQQpyK20yTUJScTBDdkpZcHFtWWlFMW9VNmNYTDFkQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJRS1ZzSVAwMzhKb1hvWnRabVorRnZVamxaRWhUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQUJmTzN3WkpvbwpFWTMvNXZIaUZLdkMxZysydWRMdytKVUk4NDQ1T2c0Si9PVlZ3RXlvK0lwQkRWZzk1MWF4Y2I2dUV4QTgrNXNzCjF1Q1dkNC9IeTVuYjVCdkVibDZRYWNiQUlpd3BycnlxdUttUW5nc2FxUlgwZW11Wk9sQVY5ZEl2ajUyYTIxWG4KVmJLSkswK2hqNnJqeS85a3VmRHVZeVZHUWloQ2tkV1NyNW85bVp5Q3MrMCtzZjlxbWNMcG9ycmtjc3dST1R4dwpXWnN2c1IzcHZSUkJLWGZZU3paVks2cDVtNTB3VEVOdGZVYTBEU3M4VVIyZ05SUmpqdzlXV1VxR04wOGF6UTVICjlGOEZnakY5Y1dyYzBva3ZrZ0tHYzVncXJYeGo2cUZHUHJCa3krckZHeHU4V1loSDVXS1hxbHozMG05NW9qVWIKR2xMMGd1dm9hQ0FqCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          - "endpoint"                   = "https://4179F25B85412BF5DFBAA8BE4E69CDC2.gr7.us-west-2.eks.amazonaws.com"
          - "kubernetes_version"         = "1.34"
          - "name"                       = "ml-platform-dev"
          - "service_cidr"               = "172.20.0.0/16"
        } -> null
    }

  # module.eks_cluster.module.eks.time_sleep.this[0] (deposed object ce4ca221) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "time_sleep" "this" {
      - create_duration = "30s" -> null
      - id              = "2025-11-08T19:11:25Z" -> null
      - triggers        = {
          - "certificate_authority_data" = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURCVENDQWUyZ0F3SUJBZ0lJY3dzT1NCanJSTG93RFFZSktvWklodmNOQVFFTEJRQXdGVEVUTUJFR0ExVUUKQXhNS2EzVmlaWEp1WlhSbGN6QWVGdzB5TlRFeE1EZ3hPVEF4TXpGYUZ3MHpOVEV4TURZeE9UQTJNekZhTUJVeApFekFSQmdOVkJBTVRDbXQxWW1WeWJtVjBaWE13Z2dFaU1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLCkFvSUJBUUMzRkc0WVBDSGNMWUFoWXNTOHVzSHRvdmN1N2JBbytKSHBTem50MWNMNSt1OThybWJUbCthMEk2SUsKSXZFQVlnT1QxS1FtZERSYlZhU1VhWVNDalVTWHJ0UnpaNTMyQ2E1QWEyandBOEhWMVc5elNUSmVmM1dERldvMgp4em0yNTgyQ0xQLzl6Wmk1WU9XaVh4aWVZRTF4aTU4eFpCbGptejdORjFJOXRpWmpWbjMxUjBDeG40V1oyc0dCCkM1SlVpYkdMdmhUVU1scy9mMXhiUi82WXNFUmNRS0g1QTlhOXBPTmtJS0U5WHlIRzU5YmJvNkpJRUZJRkFaa0gKNkw0bzByT3FkSmhGNlhFRHVnNCtzK2lNZ1U4NEtVOVVHeGp0Nk5iQ3V0MmxIcDNUREtER3JSbmJjcHUwSDJicwprR3ZGK1Zac2Q2a3ZDWlQ4ZnhjaHV1UXZrZEhIQWdNQkFBR2pXVEJYTUE0R0ExVWREd0VCL3dRRUF3SUNwREFQCkJnTlZIUk1CQWY4RUJUQURBUUgvTUIwR0ExVWREZ1FXQkJTTVpMRlhhRHlPYUpCeXFMUTZYOElsclI5RFZUQVYKQmdOVkhSRUVEakFNZ2dwcmRXSmxjbTVsZEdWek1BMEdDU3FHU0liM0RRRUJDd1VBQTRJQkFRQWVsSUdFVTBaRwpFQ08rTFJUV0tYL0h0ckhKeFF5M1dqdUpINWYzMzFrWWplb2dDSjRuRHg4dWtvbDJoa3FENVdpNjNNMVhxYnozClN5anZZb2pWbG5vYTcvaEgrZVJQM2wxLzVBUmVlYzUvYWRMQXcwdGI1b08xbmpRc2tMa0VySVJsTEtEZmV3SEoKOENNRDRjY1lQWDJZK2RNanBmSGprMkxTUUtNcUpaZC9sLzlDSVdpVlY1RHgyd0dOSmpKVkFkY1lKeXNqT1B0eQp6YjMwM3VIYnNYNXBBcEFlQnM0aXE4RlY5SzhHTGU0d1lUbHRHclQ4U25CUGJuOU5JcmFLUWN6UllCaVdueWtDCkhTZ2lVcnBoV2lyRllaTmpHclZQM2RDbDVUQlFFM0E0WDRDSzduUmo1emdTSHlJKzRDTmh6SGE1V1ZsaGpyYXMKUDBobXM0Z0tweFFKCi0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
          - "endpoint"                   = "https://5B38E0F449E599B907BF266805002BCB.sk1.us-west-2.eks.amazonaws.com"
          - "kubernetes_version"         = "1.34"
          - "name"                       = "ml-platform-dev"
          - "service_cidr"               = "172.20.0.0/16"
        } -> null
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] will be updated in-place
  ~ resource "aws_eks_node_group" "this" {
        id                     = "ml-platform-dev:ml-platform-dev-ng-20251109010759293200000002"
        tags                   = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-ng"
        }
        # (17 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-08fdb290be690713d"
            name    = "main-2025110708544931700000000b"
          ~ version = "3" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0] will be updated in-place
  ~ resource "aws_launch_template" "this" {
      ~ default_version                      = 3 -> (known after apply)
        id                                   = "lt-08fdb290be690713d"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "main-2025110708544931700000000b"
        tags                                 = {
            "Cluster"     = "ml-platform-dev"
            "Environment" = "dev"
            "Name"        = "ml-platform-dev-worker-node"
        }
        # (18 unchanged attributes hidden)

      ~ block_device_mappings {
            # (3 unchanged attributes hidden)

          ~ ebs {
              ~ volume_size                = 50 -> 30
                # (8 unchanged attributes hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 5 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#19207049638](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/19207049638)
